# Pandas - Dataframe and Series
### Pandas is a powerful data manipulation library of python, widely used for data analysis and data cleaning.

In [3]:
pip install pandas

Requirement already satisfied: pandas in /home/gagan/Desktop/Python_Learning/venv/lib/python3.12/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /home/gagan/Desktop/Python_Learning/venv/lib/python3.12/site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/gagan/Desktop/Python_Learning/venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/gagan/Desktop/Python_Learning/venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/gagan/Desktop/Python_Learning/venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/gagan/Desktop/Python_Learning/venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [9]:
import pandas as pd
import numpy as np

## Series
### A Pandas series is a one dimensional object that can hold any data type. It is similar to column in table.

In [10]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
arr1 = np.array([1, 2, 3, 4, 5])
series = pd.Series(arr1)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
# Create a Series from dictionary
dict = {
    'a': 1,
    'b': 2,
    'c': 3
}
series = pd.Series(dict)
print(series)

a    1
b    2
c    3
dtype: int64

In [25]:
arr2 = [2, 4, 6, 8, 10]
index = [1, 2, 3, 4, 5]

series = pd.Series(arr2, index)
print(series)

1     2
2     4
3     6
4     8
5    10
dtype: int64

## DataFrame
### 2-Dimensional, Heterogenous data

In [26]:
# Create a Dataframe from a dictionary of list
data = {
    'Name': ['Gagan', 'Sachin', 'Hasibul', 'Amit Kumar', 'Amit Patel'],
    'Role': ['Backend Developer', 'Frontend Developer', 'Backend Developer', 'App Developer', 'Frontend Developer'],
    'Organization': ['Primberry', 'Primberry', 'Primberry', 'Primberry', 'Primberry']
}

data_frame = pd.DataFrame(data)
print(data_frame)

         Name                Role Organization
0       Gagan   Backend Developer    Primberry
1      Sachin  Frontend Developer    Primberry
2     Hasibul   Backend Developer    Primberry
3  Amit Kumar       App Developer    Primberry
4  Amit Patel  Frontend Developer    Primberry

In [27]:
data = [
    {'Name': 'Gagan Chauhan', 'Age': 23},
    {'Name': 'Sanjeev Chauhan', 'Age': 45}
]

data_frame = pd.DataFrame(data)
print(data_frame)

              Name  Age
0    Gagan Chauhan   23
1  Sanjeev Chauhan   45

In [ ]:
# Import CSV file and find top 2 elements.
file = pd.read_csv('data_file.csv')
file.head(2)

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [31]:
file.tail(2)

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
24896,BDCQ.SEE3999A,2018.03,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24897,BDCQ.SEE3999A,2018.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN

### Accessing Data from DataFrame

In [37]:
data_frame

              Name  Age
0    Gagan Chauhan   23
1  Sanjeev Chauhan   45

In [39]:
data_frame['Name']

0      Gagan Chauhan
1    Sanjeev Chauhan
Name: Name, dtype: object

In [46]:
print(data_frame.loc[0])
print(data_frame.loc[1]['Name'])

Name    Gagan Chauhan
Age                23
Name: 0, dtype: object
Sanjeev Chauhan

In [51]:
# Accessing a specified element
print(data_frame.at[1, "Age"])

45

In [ ]:
# Data manipulation with dataframe
# Add a column:
data_frame['Gender'] = ['Male', 'Male']
print(data_frame)

In [ ]:
# Remove a column:
data_frame.drop('Gender', axis=1) # If you want to check for all dataframe "axis = 1" - Corrently it not removing permanently.

              Name  Age
0    Gagan Chauhan   23
1  Sanjeev Chauhan   45

In [58]:
data_frame.drop('Gender', axis=1, inplace=True) # It remove 'Gender' column completely

In [59]:
data_frame

              Name  Age
0    Gagan Chauhan   23
1  Sanjeev Chauhan   45

In [ ]:
file = pd.read_csv('data_file.csv')
file.describe()

,Period,Data_value,Magnitude,Series_title_4,Series_title_5
count,24898.000000,2.205900e+04,24898.000000,0.0,0.0
mean,2017.692457,7.358011e+04,2.270303,NaN,NaN
std,4.063672,2.129798e+05,2.909963,NaN,NaN
min,2011.060000,1.171797e+00,0.000000,NaN,NaN
25%,2014.090000,1.935656e+03,0.000000,NaN,NaN
50%,2018.030000,1.419000e+04,0.000000,NaN,NaN
75%,2021.060000,6.099200e+04,6.000000,NaN,NaN
max,2025.060000,2.321295e+06,6.000000,NaN,NaN